# Libraries

In [164]:
import requests
import pandas as pd
import numpy as np
import random
import matplotlib.pyplot as plt

# Functions for crimes per year

In [165]:
def group_sum_crimes(df, year):
    """
    Input: DataFrame, Int
    Output: DataFrame
    
    # We receive a dataframe, we filter it by the year passed and we return a grouped by borough dataframe.
    """
    df = df[df.year==year]
    
    return df.groupby('borough').sum().drop('year', axis=1)

In [166]:
grouped_by = []
for year in range(2008, 2017):
    grouped_by.append(group_sum_crimes(df2, year))

In [167]:
def concat_years(dfs):
    """
    Input: list
    Output: DataFrame
    
    # We'll receive a list of DataFrames and then concatenate them together
    """
    df = pd.concat([dfs[0], dfs[1]], axis=1)
    
    for dataframe in dfs[2:]:
        df = pd.concat([df, dataframe], axis=1, sort=False)
        
    return df

In [169]:
years = concat_years(grouped_by)
years.columns = range(2008, 2017)

# DF containing the sum of crimes per boroughs according to the years

In [250]:
years

,2008,2009,2010,2011,2012,2013,2014,2015,2016,Min,Max,Average
Barking and Dagenham,17656.0,17713.0,17130.0,16686,15990,15759,15426,16346,16741,15426.0,17713.0,16598.727273
Barnet,23944.0,23449.0,23416.0,24007,23573,22510,22572,24036,24684,22510.0,24684.0,23580.454545
Bexley,15305.0,14445.0,13166.0,11325,11669,11552,11844,11990,12840,11325.0,15305.0,12796.909091
Brent,23504.0,24748.0,25512.0,27669,26357,23759,24426,24883,26693,23504.0,27669.0,25338.545455
Bromley,24015.0,21858.0,19572.0,19868,19622,18945,19668,20637,20164,18945.0,24015.0,20664.454545
Camden,32010.0,31612.0,31804.0,33956,31472,28435,27198,29477,29183,27198.0,33956.0,30572.818182
Croydon,29516.0,29784.0,29373.0,29830,30189,27444,27357,28089,28712,27357.0,30189.0,28894.545455
Ealing,28947.0,28617.0,31360.0,29537,28832,25917,24978,26247,27127,24978.0,31360.0,27990.909091
Enfield,21980.0,21147.0,20808.0,21041,21069,21574,21700,22076,22485,20808.0,22485.0,21561.181818
Greenwich,22010.0,19851.0,18626.0,18552,20028,18948,19894,20929,22730,18552.0,22730.0,20259.090909
Hackney,22004.0,20718.0,20175.0,21395,27095,25633,24893,26941,28265,20175.0,28265.0,24141.727273
Hammersmith and Fulham,21114.0,21211.0,21941.0,22151,21030,18605,19185,19848,20174,18605.0,22151.0,20546.818182
Haringey,25724.0,23704.0,22156.0,23179,23231,20705,22773,24626,27174,20705.0,27174.0,23741.000000
Harrow,13774.0,13948.0,13945.0,12801,12803,11914,11909,12601,13153,11909.0,13948.0,12973.181818
Havering,15395.0,14538.0,14957.0,15496,15965,15089,14734,15870,16903,14538.0,16903.0,15489.818182
Hillingdon,24318.0,24605.0,23421.0,24282,22103,20248,23128,23234,24341,20248.0,24605.0,23139.363636
Hounslow,20204.0,19783.0,19665.0,21105,22724,19749,20005,21286,22251,19665.0,22724.0,20832.818182
Islington,26273.0,25485.0,24693.0,24980,26268,23784,24679,27032,27092,23784.0,27092.0,25560.181818
Kensington and Chelsea,20663.0,18742.0,19481.0,19146,19757,17702,17840,19070,19580,17702.0,20663.0,19122.363636
Kingston upon Thames,10661.0,10163.0,10171.0,10155,9956,9191,9288,9738,9983,9191.0,10661.0,9923.454545
Lambeth,31717.0,31225.0,31671.0,33224,33473,31868,31765,33164,34071,31225.0,34071.0,32497.636364
Lewisham,27054.0,25182.0,24532.0,24201,23652,22074,21101,23437,23904,21101.0,27054.0,23935.636364
Merton,13875.0,13561.0,13595.0,13548,12856,11595,11596,12273,12755,11595.0,13875.0,12829.454545
Newham,29752.0,28610.0,30728.0,27978,30067,27577,28005,29217,30090,27577.0,30728.0,29120.818182
Redbridge,20873.0,20837.0,20652.0,21994,21424,19793,19590,18897,19502,18897.0,21994.0,20404.818182
Richmond upon Thames,11106.0,10618.0,10601.0,10896,11168,10439,10456,10413,11074,10413.0,11168.0,10759.272727
Southwark,33470.0,30623.0,31320.0,30723,30737,31128,28912,30260,31636,28912.0,33470.0,31017.363636
Sutton,12943.0,12240.0,12032.0,11068,10948,10057,10443,10598,10658,10057.0,12943.0,11271.545455
Tower Hamlets,23578.0,21959.0,23072.0,24712,26784,26258,25504,27493,29253,21959.0,29253.0,25438.636364
Waltham Forest,24080.0,24761.0,24818.0,23714,22647,21903,20271,20969,20716,20271.0,24818.0,22633.454545
Wandsworth,23330.0,23021.0,22815.0,21384,24457,22290,21364,22401,23679,21364.0,24457.0,22778.363636
Westminster,47846.0,48456.0,48116.0,54243,59226,53852,47564,47395,48330,47395.0,59226.0,51059.000000

In [317]:
years.to_csv("years.csv")

In [308]:
#years = years.drop(['City of London'])# dropping the City of London row because not all information was accessible.

In [252]:
years['Min']=years.apply(lambda x: x.min(),axis=1)

In [253]:
years['Max']= years.apply(lambda x: x.max(),axis=1)

In [254]:
years['Average']= years.apply(lambda x: x.mean(), axis=1)

In [255]:
years[years.Average == years.Average.min()]# Over the DF; Kingston upon Thames has the least crimes.

,2008,2009,2010,2011,2012,2013,2014,2015,2016,Min,Max,Average
Kingston upon Thames,10661.0,10163.0,10171.0,10155,9956,9191,9288,9738,9983,9191.0,10661.0,9923.454545

In [256]:
years[years.Average == years.Average.max()]# Over the DF; Westminster has the most crimes

,2008,2009,2010,2011,2012,2013,2014,2015,2016,Min,Max,Average
Westminster,47846.0,48456.0,48116.0,54243,59226,53852,47564,47395,48330,47395.0,59226.0,51059.0

In [319]:
description = years.describe() # statistics of the DF

In [ ]:
years.desci

In [258]:
years.loc[:,:].max()

2008       47846.0
2009       48456.0
2010       48116.0
2011       54243.0
2012       59226.0
2013       53852.0
2014       47564.0
2015       47395.0
2016       48330.0
Min        47395.0
Max        59226.0
Average    51059.0
dtype: float64

In [259]:
years.idxmax(axis=0, skipna=True)# The borough which has the most crimes related to the year

2008       Westminster
2009       Westminster
2010       Westminster
2011       Westminster
2012       Westminster
2013       Westminster
2014       Westminster
2015       Westminster
2016       Westminster
Min        Westminster
Max        Westminster
Average    Westminster
dtype: object

In [260]:
years.idxmin(axis=0, skipna=True)#The borough which has the less crimes related to the year

2008       Kingston upon Thames
2009       Kingston upon Thames
2010       Kingston upon Thames
2011       Kingston upon Thames
2012       Kingston upon Thames
2013       Kingston upon Thames
2014       Kingston upon Thames
2015       Kingston upon Thames
2016       Kingston upon Thames
Min        Kingston upon Thames
Max        Kingston upon Thames
Average    Kingston upon Thames
dtype: object

In [261]:
years.loc['Kensington and Chelsea'].mean()

19122.363636363636

# Dataframe for the major crimes types

In [262]:
df = df[df.year==year]

In [313]:
#df_crimes= df2.groupby(['major_category']).sum().drop(['year'],axis=1)
df_crimes= df2.groupby(['year','major_category']).sum()

In [314]:
df_crimes

                                   value
year major_category
2008 Burglary                      88092
     Criminal Damage               91872
     Drugs                         68804
     Fraud or Forgery               5325
     Other Notifiable Offences     10112
     Robbery                       29627
     Sexual Offences                1273
     Theft and Handling           283692
     Violence Against the Person  159844
2009 Burglary                      90619
     Criminal Damage               85565
     Drugs                         60549
     Other Notifiable Offences     10644
     Robbery                       29568
     Theft and Handling           279492
     Violence Against the Person  160777
2010 Burglary                      86826
     Criminal Damage               77897
     Drugs                         58674
     Other Notifiable Offences     10768
     Robbery                       32341
     Theft and Handling           290924
     Violence Against the Person  157894
2011 Burglary                      93315
     Criminal Damage               70914
     Drugs                         57550
     Other Notifiable Offences     10264
     Robbery                       36679
     Theft and Handling           309292
     Violence Against the Person  146901
...                                  ...
2012 Theft and Handling           334054
     Violence Against the Person  150014
2013 Burglary                      87222
     Criminal Damage               56206
     Drugs                         50278
     Other Notifiable Offences     10811
     Robbery                       29337
     Theft and Handling           306372
     Violence Against the Person  146181
2014 Burglary                      76053
     Criminal Damage               59279
     Drugs                         44435
     Other Notifiable Offences     13037
     Robbery                       22150
     Theft and Handling           279880
     Violence Against the Person  185349
2015 Burglary                      70489
     Criminal Damage               62976
     Drugs                         39785
     Other Notifiable Offences     14229
     Robbery                       21383
     Theft and Handling           284022
     Violence Against the Person  218740
2016 Burglary                      68285
     Criminal Damage               64071
     Drugs                         38914
     Other Notifiable Offences     15809
     Robbery                       22528
     Theft and Handling           294133
     Violence Against the Person  232381

[65 rows x 1 columns]

In [318]:
df_crimes.to_csv("crimes.csv")

In [315]:
df_crimes[df_crimes.value == df_crimes.value.min()]# This is the crime with the least amount.

                      value
year major_category
2008 Sexual Offences   1273

In [316]:
df_crimes[df_crimes.value == df_crimes.value.max()]# This is the biggest issue in London.

                          value
year major_category
2012 Theft and Handling  334054

# Some Info

In [267]:
df = pd.read_csv('/Users/vladimirautier/Documents/GitHub/Week4/Code_project_3/london_crime_by_lsoa.csv')# overall DF

In [268]:
df.head()

,lsoa_code,borough,major_category,minor_category,value,year,month
0,E01001116,Croydon,Burglary,Burglary in Other Buildings,0,2016,11
1,E01001646,Greenwich,Violence Against the Person,Other violence,0,2016,11
2,E01000677,Bromley,Violence Against the Person,Other violence,0,2015,5
3,E01003774,Redbridge,Burglary,Burglary in Other Buildings,0,2016,3
4,E01004563,Wandsworth,Robbery,Personal Property,0,2008,6

We have the dataframe for the major crimes in London from 2008-2016 listed in different Borroughs

In [269]:
#Looking at the different types of elements in our DF
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13490604 entries, 0 to 13490603
Data columns (total 7 columns):
lsoa_code         object
borough           object
major_category    object
minor_category    object
value             int64
year              int64
month             int64
dtypes: int64(3), object(4)
memory usage: 720.5+ MB
None

In [270]:
#df['year'].unique()
df1 = df.sort_values('year')

In [271]:
df1.head()#ordering the years

,lsoa_code,borough,major_category,minor_category,value,year,month
12504370,E01001255,Ealing,Violence Against the Person,Assault with Injury,0,2008,6
5807276,E01002790,Islington,Violence Against the Person,Harassment,0,2008,2
5807272,E01003634,Newham,Burglary,Burglary in Other Buildings,0,2008,9
8512153,E01033698,Hackney,Theft and Handling,Motor Vehicle Interference & Tampering,0,2008,8
5807264,E01004565,Wandsworth,Drugs,Possession Of Drugs,0,2008,3

In [272]:
df1['year'].unique()

array([2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016])

In [273]:
dict= {1:'January',2:'February',3:"March",4:'April',5:'May',6:'June',7:'July',8:'August',9:'September',10:'October',11:'November',12:'December'}
df1['month'].replace(dict,inplace=True)

In [274]:
df1.head()

,lsoa_code,borough,major_category,minor_category,value,year,month
12504370,E01001255,Ealing,Violence Against the Person,Assault with Injury,0,2008,June
5807276,E01002790,Islington,Violence Against the Person,Harassment,0,2008,February
5807272,E01003634,Newham,Burglary,Burglary in Other Buildings,0,2008,September
8512153,E01033698,Hackney,Theft and Handling,Motor Vehicle Interference & Tampering,0,2008,August
5807264,E01004565,Wandsworth,Drugs,Possession Of Drugs,0,2008,March

In [275]:
df1.drop(['lsoa_code'],axis=1,inplace=True) #dropping the lsoa_code

In [276]:
df1.head()

,borough,major_category,minor_category,value,year,month
12504370,Ealing,Violence Against the Person,Assault with Injury,0,2008,June
5807276,Islington,Violence Against the Person,Harassment,0,2008,February
5807272,Newham,Burglary,Burglary in Other Buildings,0,2008,September
8512153,Hackney,Theft and Handling,Motor Vehicle Interference & Tampering,0,2008,August
5807264,Wandsworth,Drugs,Possession Of Drugs,0,2008,March

In [277]:
df2 = df1[df1.value!=0]# erasing the 0 value in column=value and calling it df2

In [278]:
df2.head()

,borough,major_category,minor_category,value,year,month
1315511,Tower Hamlets,Violence Against the Person,Common Assault,2,2008,September
2874646,Southwark,Robbery,Business Property,1,2008,July
8512166,Camden,Criminal Damage,Other Criminal Damage,1,2008,September
8512169,Hounslow,Drugs,Possession Of Drugs,2,2008,September
5807242,Kingston upon Thames,Theft and Handling,Other Theft,2,2008,November

In [279]:
df2.groupby(['year']).sum() # groupby year to find the total value of crimes per year

       value
year
2008  738641
2009  717214
2010  715324
2011  724915
2012  737329
2013  686407
2014  680183
2015  711624
2016  736121

This is the total value of crimes per year

# Data 2008

In [280]:
df_2008 = df2[df2.year==2008]

In [281]:
#df_2008.groupby(['borough','major_category']).sum().drop(['year'],axis=1)

In [283]:
a = df_2008.groupby(['borough']).sum().drop(['year'],axis=1)

Number of crimes per borough in 2008

# Data 2009

In [284]:
df_2009 = df2[df2.year==2009]

In [285]:
#df_2009.groupby(['borough','major_category']).sum().drop(['year'],axis=1)

In [286]:
b = df_2009.groupby(['borough']).sum().drop(['year'],axis=1)

Number of crimes per borough in 2009

# Data 2010

In [287]:
df_2010 = df2[df2.year==2010]

In [288]:
#df_2010.groupby(['borough','major_category']).sum().drop(['year'],axis=1)

In [289]:
c = df_2010.groupby(['borough']).sum().drop(['year'],axis=1)

Number of crimes per borough in 2010

# Data 2011

In [290]:
df_2011 = df2[df2.year==2011]

In [291]:
#df_2011.groupby(['borough','major_category']).sum().drop(['year'],axis=1)

In [292]:
d = df_2011.groupby(['borough']).sum().drop(['year'],axis=1)

Number of crimes per borough in 2011

# Data 2012

In [293]:
df_2012 = df2[df2.year==2012]

In [294]:
#df_2012.groupby(['borough','major_category']).sum().drop(['year'],axis=1)

In [295]:
e = df_2012.groupby(['borough']).sum().drop(['year'],axis=1)

Number of crimes per borough in 2012

# Data 2013

In [296]:
df_2013 = df2[df2.year==2013]

In [297]:
#df_2013.groupby(['borough','major_category']).sum().drop(['year'],axis=1)

In [298]:
f = df_2013.groupby(['borough']).sum().drop(['year'],axis=1)

Number of crimes per borough in 2013

# Data 2014

In [299]:
df_2014 = df2[df2.year==2014]

In [300]:
#df_2014.groupby(['borough','major_category']).sum().drop(['year'],axis=1)

In [301]:
g = df_2014.groupby(['borough']).sum().drop(['year'],axis=1)

Number of crimes per borough in 2014

# Data 2015

In [302]:
df_2015 = df2[df2.year==2015]

In [303]:
#df_2015.groupby(['borough','major_category']).sum().drop(['year'],axis=1)

In [304]:
h = df_2015.groupby(['borough']).sum().drop(['year'],axis=1)

Number of crimes per borough in 2015

# Data 2016

In [305]:
df_2016 = df2[df2.year==2016]

In [306]:
#df_2016.groupby(['borough','major_category']).sum().drop(['year'],axis=1)

In [307]:
i = df_2016.groupby(['borough']).sum().drop(['year'],axis=1)

Number of crimes per borough in 2016